{
  "comment": "I just discovered your product this morning and although missing some of what YNAB does, it does everything I need so far. I'm expecting to be sending $49 your way after a month or two of making sure.\n\nWill the mobile versions be standalone, or will they access data in a cloud share or something?\n\nWhen I first read about the rain feature, I liked it, but I misunderstood it. Through that though (if there are enough people that operate like me) I have an idea for another bucket type. The want/rain is ok if you are saving or if your bills are consistent. I'm a long time YNAB user - it helped me get out of debt and I'm pretty much in a budget maintenance mode. So, for my bills I like to budget for worst case scenario. If my largest electric bill is $200, that's what I budget. I also have a couple of irregular timed bills - garbage pickup gets paid every other month, water every third month.\n\nIn all of these, I just budget the biggest bill I've ever had. That means for things like electric it's slightly over budgeted in the summer, but way over budgeted in the winter. Once paid, I just refill the bucket. So, if I have $200 budgeted in electric and my bill was $75 I just pay it and have $125 left over and add $75 back next paycheck so its always there. If I use the want/rain feature it would just keep piling on $200 a month.\n\nHaving another bucket type that just gets refilled to the want level would be pretty awesome. So before I start hand budgeting I could hit the rain button and have it fill all those bill buckets back to their full level. It would also make the rain button a dual use automation button - would put the extra funds onto the recurring expense buckets and refill the irregular expense buckets.\n\nNice product though. It definitely hits the sweet spot for me. Imports from any of my banks don't work through SimpleFin for some reason, they just hang and fail, but that's not your issue. Export to Quicken and Import seems to work, which is what I had to do in YNAB anyways because every month or two it would double or skip automatically imported transactions and make me waste time trying to figure out what happened. I'm excited to see what you do with this platform going forward.",
  "email": null,
  "name": "Bill",
  "subdir": "well-hello-there",
  "_id": "1635882202326-54pio0cj34r",
  "date": 1635882202326
}